In [19]:
import pandas as pd
import numpy as np
obj=pd.Series([4,7,-5,-3])
print(obj,"\n")
print(obj.values,"\n")
print(obj.index)

0    4
1    7
2   -5
3   -3
dtype: int64

[ 4  7 -5 -3]

RangeIndex(start=0, stop=4, step=1)

In [27]:
obj2=pd.Series([4,7,-5,3],index=["d","b","a","c"])
print(obj2,"\n")
print(obj2.index,"\n");
print(obj2["a"],"\n")
print(obj2[["c","a","d"]],"\n")
print(obj2[obj2>0],"\n")
print(obj2*2,"\n")
print(np.exp(obj2),"\n")
print("Busqueda: ","e" in obj2,"\n")

d    4
b    7
a   -5
c    3
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

-5

c    3
a   -5
d    4
dtype: int64

d    4
b    7
c    3
dtype: int64

d     8
b    14
a   -10
c     6
dtype: int64

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Busqueda False

In [45]:
sdata={"Chia":35000,"Madrid":71000,"Soacha":16000,"Suba":5000}
obj3=pd.Series(sdata)
municipio=["Salitre","Chia","Soacha","Suba"]
obj4=pd.Series(sdata,index=municipio) 
print(obj4,"\n")
print(pd.isnull(obj4),"\n")
print(obj4.isnull(),"\n")
print(obj3+obj4)

Salitre        NaN
Chia       35000.0
Soacha     16000.0
Suba        5000.0
dtype: float64

Salitre     True
Chia       False
Soacha     False
Suba       False
dtype: bool

Salitre     True
Chia       False
Soacha     False
Suba       False
dtype: bool

Chia       70000.0
Madrid         NaN
Salitre        NaN
Soacha     32000.0
Suba       10000.0
dtype: float64

In [48]:
obj4.name="Población"
obj4.index.name="Municipios"
obj4

Municipios
Salitre        NaN
Chia       35000.0
Soacha     16000.0
Suba        5000.0
Name: Población, dtype: float64

In [62]:
data={ "municipio":["Suba","Suba","Suba","Usme","Usme","Usme"],
     "año":[2000,2001,2002,2001,2002,2003],
     "pob":[1.5,1.7,3.6,2.4,2.9,3.2] }
frame=pd.DataFrame(data)
print(frame,"\n")
pd.DataFrame(data,columns=["año","municipio","pob"])

  municipio   año  pob
0      Suba  2000  1.5
1      Suba  2001  1.7
2      Suba  2002  3.6
3      Usme  2001  2.4
4      Usme  2002  2.9
5      Usme  2003  3.2

    año municipio  pob
0  2000      Suba  1.5
1  2001      Suba  1.7
2  2002      Suba  3.6
3  2001      Usme  2.4
4  2002      Usme  2.9
5  2003      Usme  3.2

In [82]:
frame2=pd.DataFrame(data,columns=["año","municipio","pob","deuda"],
                   index=["uno","dos","tres","cuatro","cinco","seis"])
frame2.columns
frame2["municipio"]
frame2.año
frame2.loc["tres"] #Busca la posición, osea el index xD
frame2.deuda=16.5 #Deja por defecto toda la columna en 16.5
frame2.deuda=np.arange(6.) 
frame2

         año municipio  pob  deuda
uno     2000      Suba  1.5    0.0
dos     2001      Suba  1.7    1.0
tres    2002      Suba  3.6    2.0
cuatro  2001      Usme  2.4    3.0
cinco   2002      Usme  2.9    4.0
seis    2003      Usme  3.2    5.0

In [85]:
#Puedo crear mis propias series y agregarlas a otro frame, pues mirar y ya
valores=pd.Series([-1.2,-1.5,-1.7],index=["dos","cuatro","cinco"])
frame2.deuda=valores
frame2

         año municipio  pob  deuda
uno     2000      Suba  1.5    NaN
dos     2001      Suba  1.7   -1.2
tres    2002      Suba  3.6    NaN
cuatro  2001      Usme  2.4   -1.5
cinco   2002      Usme  2.9   -1.7
seis    2003      Usme  3.2    NaN

In [92]:
poblacion={"Usme":{2001:2.4,2002:2.9},
          "Suba":{2000:1.5,2001:1.7,2002:3.6}}
frame3=pd.DataFrame(poblacion)
frame3 #Indices 2001, 2002 ,2002
frame3.T #La Transpuesta

      2001  2002  2000
Usme   2.4   2.9   NaN
Suba   1.7   3.6   1.5

In [97]:
pd.DataFrame(poblacion, index=[2001,2002,2003]) #Retornará valores del 2001-2003
pdta={"Usme":frame3["Usme"][:-1],
      "Suba":frame3["Suba"][:2] }
pdta
pd.DataFrame(pdta)

      Usme  Suba
2001   2.4   1.7
2002   2.9   3.6

In [102]:
frame3.index.name="año" 
frame3.columns.name="municipio"
print(frame3)
"Usme" in frame3.columns #True or false
2003 in frame3.index #True or false

municipio  Usme  Suba
año
2001        2.4   1.7
2002        2.9   3.6
2000        NaN   1.5

False

In [104]:
dup_labels=pd.Index(["foo","foo","bar","bar"])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [110]:
obj=pd.Series(range(3),index=["a","b","c"])
index=obj.index
index
index[1:]
#Los objetos de índice son inmutables y, por lo tanto, el usuario no puede modificarlos
#index[1]="d" #No deja ya que es inmutable

Index(['b', 'c'], dtype='object')

In [114]:
obj=pd.Series([4.5,7.2,-5.3,3.6], index=["d","b","a","c"])
obj2=obj.reindex(["a","b","c","d","e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [123]:
obj3=pd.Series(["blue","purple","yellow"],index=[0,2,4])
print(obj3,"\n")
print(obj3.reindex(range(6),method="ffill")) #Rellena XD

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [126]:
frame4=pd.DataFrame(np.arange(9).reshape((3,3)),
                   index=["a","b","c"],
                   columns=["Ohio","Texas","California"])
frame4

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [129]:
frame5=frame4.reindex(["a","b","c","d"])
frame5

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [142]:
dep=["Texas","Atlantico","Ohio"]
frame5=frame4.reindex(columns=dep)
print(frame5,"\n")
#frame4.loc[["a","b","c","d"],dep] loc es para etiquetas

   Texas  Atlantico  Ohio
a      1        NaN     0
b      4        NaN     3
c      7        NaN     6

In [145]:
obj=pd.Series(np.arange(5.),index=["a","b","c","d","e"])
new_obj=obj.drop("c")
new_obj #Elimina el indixe c

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [148]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=["Ohio","Colorado","Utah","New York"],
                 columns=["one","two","three","four"])
newD=data.drop(["Colorado","Ohio"])
print(newD)
newD=data.drop(["two","four"],axis="columns")
newD

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [152]:
#Indexación, selección y filtrado
obj=pd.Series(np.arange(4),index=["a","b","c","d"])
obj
obj["b"]
obj[["b","a","d"]]
obj[obj<2]
obj["b":"c"]=5
obj

a    0
b    5
c    5
d    3
dtype: int32

In [160]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=["Ohio","Colorado","Utah","New York"],
                 columns=["one","two","three","four"])
data[["three","one"]]
data[:2]
data[data["three"]>5] #Que en la columna "three" sean mayores a 5 pues imprimalo
data<5 #LLena la tabla de true y false, 
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [161]:
# loc busca por etiquetas y iloc por enteros

In [164]:
#Aritmética y alineación de datos
s1=pd.Series([7.3,-2.5,3.4,1.5],index=["a","c","d","e"])
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=["a","c","e","f","g"])
print(s1+s2)

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [181]:
df1=pd.DataFrame(np.arange(9.).reshape((3,3)), 
                columns=list("bcd"),
                index=["Ohio","Texas","Colorado"])

df2=pd.DataFrame(np.arange(12.).reshape((4,3)), 
                columns=list("bde"),
                index=["Utah","Ohio","Texas","Oregon"])
print(df1,"\n")
print(df2,"\n")
print(df1+df2)
print(df1.add(df2,fill_value=0),"\n") #Suma y aquellos que literalmente no haya match entre columnas y indixes le ponen NaN   
print(df1.div(1),"\n")

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN
            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0